Autodesk.Revit.DB.FillPattern.ExpandDots
Corrects pattern dots to make them be drawn properly for Revit.
Returns:
Indicates whether any dots were in fact expanded.

Autodesk.Revit.DB.FillPattern.IsEqual(Autodesk.Revit.DB.FillPattern)
Check if the contents in two fill patterns are equal.
other:
The fill pattern to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FillPattern.SetFillGrids(System.Collections.Generic.IList{Autodesk.Revit.DB.FillGrid})
Set the fill grids in this fill pattern.
fillGrids:
The fill grids to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FillPattern.GetFillGrids
Gets all fill grids in this fill pattern
Returns:
The fill grids.

Autodesk.Revit.DB.FillPattern.SetFillGrid(System.Int32,Autodesk.Revit.DB.FillGrid)
Sets the fill grid.
gridIdx:
The index of the fill grid.
fillGrid:
The fill grid to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FillPattern.GetFillGrid(System.Int32)
Gets the specified fill grid.
gridIdx:
The index of the fill grid.
Returns:
The fill grid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index of the FillGrid is not valid.

Autodesk.Revit.DB.FillPattern.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FillPattern.Name
The name of the fill pattern.
Remarks:
The name of solid fill patterns cannot be changed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.FillPattern.LinesPerLength
Gets the number of solid lines that placed in unit length.

Autodesk.Revit.DB.FillPattern.StrokesPerArea
Gets the number of strokes that placed on unit area.

Autodesk.Revit.DB.FillPattern.LengthPerArea
Gets length of all lines that placed on unit area.

Autodesk.Revit.DB.FillPattern.IsSolidFill
Check if the fill pattern is a solid fill pattern.

Autodesk.Revit.DB.FillPattern.GridCount
Gets the count of the fill grids in this fill pattern.

Autodesk.Revit.DB.FillPattern.Target
Target of this fill pattern applied to.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.HostOrientation
Orientation to host layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor(System.String,Autodesk.Revit.DB.FillPatternTarget,Autodesk.Revit.DB.FillPatternHostOrientation,System.Double,System.Double,System.Double)
Creates a simple crosshatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
name:
The name.
target:
The fill pattern target.
orientation:
The fill pattern orientation.
angle:
The angle.
spacing1:
The spacing.
spacing2:
The spacing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor(System.String,Autodesk.Revit.DB.FillPatternTarget,Autodesk.Revit.DB.FillPatternHostOrientation,System.Double,System.Double)
Creates a simple hatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
name:
The name.
target:
The fill pattern target.
orientation:
The fill pattern orientation.
angle:
The angle.
spacing1:
The spacing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor(System.String,Autodesk.Revit.DB.FillPatternTarget,Autodesk.Revit.DB.FillPatternHostOrientation)
Creates a fill pattern based on the given name, FillPatternTarget and FillPatternHostOrientation.
name:
The name.
target:
The fill pattern target.
orientation:
The fill pattern orientation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor
Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.

Autodesk.Revit.DB.FillPattern.#ctor(Autodesk.Revit.DB.FillPattern)
Constructs a new copy of the input FillPattern object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FillPattern
Represents a fill pattern object.
Remarks:
Fill patterns control the appearance of surfaces that are cut or shown in projection.
A simple fill pattern consists of a series of parallel or orthogonal lines.
Note - Dots are coded as zero-length dashes in the fill pattern definition.
When the Revit graphic engine encounters a zero-length line it simply ignores it and doesn't draw anything.
So call ExpandDots() for the patterns you construct to convert dots to small dashes, so that the rendering of the FillPattern is correct.